<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"b4978e5d863e0168c0740f87b3f0c6cb203f58e6028bba39c9ad0b081dd57a23","plan_job_ref":"Job Create terraform plan #18 at https://github.com/leonitousconforti/infra/actions/runs/15420272884","plan_out_hash":"9813aaaea0171b88f21037c0931b3d72f548875e3005bcd8a47fdeb40f3cdfa1","plan_hash":"a20826245fd409676ec369822ffdb9ae723bf2bbcd2bf0a793254d2d65cef53b","plan_text_format":"diff","version":"2.0.0"} -->
Terraform plan in __leo69.lol__<details open><summary>With variables</summary>

```hcl
do_token           = (sensitive value)
porkbun_api_key    = (sensitive value)
porkbun_secret_key = (sensitive value)
```
</details>
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # digitalocean_domain.leo69_lol will be created
+   resource "digitalocean_domain" "leo69_lol" {
+       id   = (known after apply)
+       name = "leo69.lol"
+       ttl  = (known after apply)
+       urn  = (known after apply)
    }

  # digitalocean_project_resources.leo69_lol_project will be created
+   resource "digitalocean_project_resources" "leo69_lol_project" {
+       id        = (known after apply)
+       project   = "acf5abcc-4976-4233-9832-7c7ca3efea5a"
+       resources = (known after apply)
    }

  # porkbun_domain_nameservers.leo69_lol_nameservers will be created
+   resource "porkbun_domain_nameservers" "leo69_lol_nameservers" {
+       domain      = "leo69.lol"
+       nameservers = [
+           "ns1.digitalocean.com",
+           "ns2.digitalocean.com",
+           "ns3.digitalocean.com",
        ]
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #18](https://github.com/leonitousconforti/infra/actions/runs/15420272884)